
### Here's the result of $ leverage tf init and apply

**$ leverage tf init**
```
19:35:55]   INFO MFA: Found 2 profile/s
[19:35:55]   INFO MFA: Attempting to get temporary credentials for profile bb-apps-devstg-devops
MFA: Please type in your OTP: ******
[19:36:15]   INFO MFA: Credentials written succesfully!
[19:36:15]   INFO MFA: Attempting to get temporary credentials for profile bb-shared-devops
MFA: Please type in your OTP: ******
[19:36:48]   INFO MFA: Credentials written succesfully!
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/vault from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hashicorp/aws v4.6.0...
- Installed hashicorp/aws v4.6.0 (signed by HashiCorp)
- Installing hashicorp/vault v3.3.1...
- Installed hashicorp/vault v3.3.1 (signed by HashiCorp)
- Installing hashicorp/random v3.1.2...
- Installed hashicorp/random v3.1.2 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

**$ leverage tf apply**

```
[16:36:06]   INFO MFA: Found 2 profile/s
[16:36:06]   INFO MFA: Attempting to get temporary credentials for profile bb-apps-devstg-devops
[16:36:10]   INFO MFA: Using cached credentials
[16:36:14]   INFO MFA: Credentials written succesfully!
[16:36:14]   INFO MFA: Attempting to get temporary credentials for profile bb-shared-devops
[16:36:18]   INFO MFA: Using cached credentials
[16:36:22]   INFO MFA: Credentials written succesfully!
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.bb_mysql_db will be created
  + resource "aws_security_group" "bb_mysql_db" {
      + arn                    = (known after apply)
      + description            = "Binbash Reference MySQL DB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bb_mysql_db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-072f329fed6757e95"
    }

  # aws_security_group_rule.allow_mysql_port will be created
  + resource "aws_security_group_rule" "allow_mysql_port" {
      + cidr_blocks              = [
          + "172.18.32.0/20",
          + "172.18.0.0/20",
        ]
      + description              = "Allow PostgreSQL from DevStg and Shared"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.bb_mysql_db.random_password.master_password[0] will be created
  + resource "random_password" "master_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.bb_mysql_db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 100
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_window                         = "00:00-02:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "bb_devstg_binbash_mysql"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.21"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "bb-apps-devstg-binbash-mysql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.m5.large"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "tue:03:00-tue:06:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all                              = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + username                              = "administrator"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "bb-apps-devstg-binbash-mysql"
        }
    }

  # module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = (known after apply)
      + name_prefix              = "bb-apps-devstg-binbash-mysql-"
      + option_group_description = "bb-apps-devstg-binbash-mysql option group"
      + tags                     = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }

      + timeouts {}
    }

  # module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "bb-apps-devstg-binbash-mysql parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "bb-apps-devstg-binbash-mysql-"
      + tags        = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
    }

  # module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "bb-apps-devstg-binbash-mysql subnet group"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "bb-apps-devstg-binbash-mysql-"
      + subnet_ids  = [
          + "subnet-05d75d908f61d35e5",
          + "subnet-094c287defbc07180",
          + "subnet-0cec521de70ee76a3",
        ]
      + tags        = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bb_reference_db_id = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Creating...
module.bb_mysql_db.random_password.master_password[0]: Creating...
module.bb_mysql_db.random_password.master_password[0]: Creation complete after 0s [id=none]
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Creation complete after 0s [id=4UOkfw]
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creating...
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Creating...
aws_security_group.bb_mysql_db: Creating...
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Creating...
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Creation complete after 2s [id=bb-apps-devstg-binbash-mysql-20220320163659730600000002]
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Creation complete after 2s [id=bb-apps-devstg-binbash-mysql-20220320163659730700000003]
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creation complete after 3s [id=bb-apps-devstg-binbash-mysql-20220320163659711400000001]
aws_security_group.bb_mysql_db: Creation complete after 3s [id=sg-02c4f14a2ccc01c6b]
aws_security_group_rule.allow_mysql_port: Creating...
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Creating...
aws_security_group_rule.allow_mysql_port: Creation complete after 2s [id=sgrule-2131069860]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [20s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [30s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [40s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [50s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m0s elapsed]
.
.
.
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [17m0s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [17m10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [17m20s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Creation complete after 17m29s [id=bb-apps-devstg-binbash-mysql]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

Outputs:

bb_reference_db_id = "bb-apps-devstg-binbash-mysql"
```



